---
kind: method
id: M:Autodesk.Revit.DB.ElementMulticategoryFilter.GetCategoryIds
source: html/9cac5860-9125-cad2-4390-7599dfd4581a.htm
---
# Autodesk.Revit.DB.ElementMulticategoryFilter.GetCategoryIds Method

Gets the category ids assigned to this filter.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetCategoryIds()
```

## Returns
The category ids.